Revit 2027 API
AdaptiveComponentInstanceUtils.HasAdaptiveFamilySymbol Method
 Verifies if a FamilyInstance has an Adaptive Family Symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool HasAdaptiveFamilySymbol(
	FamilyInstance famInst
)
Public Shared Function HasAdaptiveFamilySymbol (
	famInst As FamilyInstance
) As Boolean
public:
static bool HasAdaptiveFamilySymbol(
	FamilyInstance^ famInst
)
static member HasAdaptiveFamilySymbol :
        famInst : FamilyInstance -> bool
Parameters
famInst FamilyInstance
 The FamilyInstance
Return Value
Boolean
 True if the FamilyInstance has an Adaptive Family Symbol.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace